package com.example.solidconnection.constants;

import java.util.List;

public class NicknameForApplyWords {
    public static final List<String> adjectives = List.of(
            "기쁜", "행복한", "즐거운", "밝은", "따뜻한", "시원한", "고고한", "예쁜", "신선한", "풍부한", "깨끗한",
            "귀한", "눈부신", "멋진", "고귀한", "화려한", "상큼한", "활기찬", "유쾌한", "똘똘한", "친절한", "눈부신", "좋은",
            "영리한", "용감한", "정직한", "성실한", "강인한", "귀여운", "순수한", "희망찬", "발랄한", "나른한", "후한", "빛나는",
            "따스한", "안락한", "편안한", "성공한");

    public static final List<String> nouns = List.of(
            "청춘", "토끼", "기사", "곰", "사슴", "여우", "팬더", "이슬", "새싹", "햇빛", "나비", "별", "달", "구름",
            "사탕", "젤리", "마법", "풍선", "캔디", "초코", "인형", "쿠키", "요정", "장미", "마녀", "보물", "꽃", "보석",
            "달빛", "오리", "날개", "여행", "편지", "불꽃");
}
